Repository: NicolaLS/payment-app
Catalog: apps/blip/feature/onboarding/src/iosMain/resources/BlipOnboarding.xcstrings
Source language: en
Languages: de, es

# onboarding_add_wallet_dashboard_button
source: Open Blink API Keys
de: Blink-API-Schlüssel öffnen
es: Abrir Claves API de Blink

# onboarding_add_wallet_enter_key_button
source: Enter API key
de: API-Schlüssel eingeben
es: Ingresar clave API

# onboarding_add_wallet_intro
source: Follow these four steps in the Blink dashboard. Blip needs Read and Write access to check your wallet and send payments.
de: Folge diesen vier Schritten im Blink-Dashboard. Blip benötigt Lese- und Schreibzugriff, um deine Wallet zu prüfen und Zahlungen zu senden.
es: Sigue estos cuatro pasos en el panel de Blink. Blip necesita acceso de Lectura y Escritura para consultar tu billetera y enviar pagos.

# onboarding_add_wallet_next_step
source: Next
de: Weiter
es: Siguiente

# onboarding_add_wallet_previous_step
source: Previous
de: Vorheriger
es: Anterior

# onboarding_add_wallet_step_progress
source: Step %1$lld of %2$lld
de: Schritt %1$lld von %2$lld
es: Paso %1$lld de %2$lld

# onboarding_add_wallet_step1_body
source: Sign in with your Blink account. Email is recommended, but use whichever login method works for you.
de: Melde dich bei deinem Blink-Konto an. E-Mail wird empfohlen, aber nutze die Anmeldemethode, die für dich funktioniert.
es: Inicia sesión con tu cuenta Blink. Recomendamos usar el correo, pero puedes usar el método que te funcione.

# onboarding_add_wallet_step1_title
source: Sign in to Blink
de: Bei Blink anmelden
es: Inicia sesión en Blink

# onboarding_add_wallet_step2_body
source: After signing in, the dashboard opens API Keys. Tap + to create a new key.
de: Nach der Anmeldung öffnet das Dashboard die API-Schlüssel. Tippe auf +, um einen neuen Schlüssel zu erstellen.
es: Después de iniciar sesión, el panel abre Claves API. Toca + para crear una clave nueva.

# onboarding_add_wallet_step2_title
source: Add an API key
de: API-Schlüssel hinzufügen
es: Añade una clave API

# onboarding_add_wallet_step3_body
source: Choose a name and expiry, and enable Read and Write access. Then tap Create.
de: Wähle einen Namen und eine Ablaufzeit und aktiviere Lesen und Schreiben. Tippe dann auf Erstellen.
es: Elige un nombre y una fecha de caducidad, y activa Lectura y Escritura. Luego toca Crear.

# onboarding_add_wallet_step3_title
source: Configure the key
de: Schlüssel konfigurieren
es: Configura la clave

# onboarding_add_wallet_step4_body
source: Copy the value beginning with blink_ before closing. Return to Blip and paste it on the next screen.
de: Kopiere den mit blink_ beginnenden Wert vor dem Schließen. Kehre zu Blip zurück und füge ihn auf dem nächsten Bildschirm ein.
es: Copia el valor que comienza con blink_ antes de cerrar. Regresa a Blip y pégalo en la siguiente pantalla.

# onboarding_add_wallet_step4_title
source: Copy the secret once
de: Geheimen Schlüssel sofort kopieren
es: Copia el secreto de inmediato

# onboarding_add_wallet_title
source: Connect your Blink wallet
de: Verbinde deine Blink-Wallet
es: Conecta tu billetera Blink

# onboarding_agreement_body
source: Using Blip is at your own risk. This app connects to your own Lightning wallet — you are fully responsible for the funds in your wallet and any payments made. We strongly recommend connecting wallets with small spending balances.
de: Die Nutzung von Blip erfolgt auf eigenes Risiko. Diese App verbindet sich mit deiner eigenen Lightning-Wallet — du bist vollständig verantwortlich für die Gelder in deiner Wallet und alle getätigten Zahlungen. Wir empfehlen dringend, Wallets mit kleinem Guthaben zu verbinden.
es: Usar Blip es bajo tu propio riesgo. Esta app se conecta a tu propia billetera Lightning — eres totalmente responsable de los fondos en tu billetera y de cualquier pago realizado. Recomendamos encarecidamente conectar billeteras con saldos pequeños.

# onboarding_autopay_body
source: Choose when Blip should ask for confirmation before paying.
de: Wähle aus, wann Blip vor einer Zahlung um Bestätigung bitten soll.
es: Elige cuándo Blip debe pedir confirmación antes de pagar.

# onboarding_features_page1_body
source: Blip scans in the background so checkout stays smooth. Aim at the code, wait a beat, and you’re good.
de: Blip scannt im Hintergrund für einen reibungslosen Checkout. Richte auf den Code, warte kurz, fertig.
es: Blip escanea en segundo plano para un pago fluido. Apunta al código, espera un momento y listo.

# onboarding_features_page1_subtitle
source: It’s working — even if you can’t see the camera.
de: Es funktioniert — auch wenn du die Kamera nicht siehst.
es: Está funcionando — aunque no veas la cámara.

# onboarding_features_page1_title
source: Quiet scanner, quick results
de: Leiser Scanner, schnelle Ergebnisse
es: Escáner silencioso, resultados rápidos

# onboarding_features_page2_body
source: Set a limit you’re comfortable with. For anything above it, Blip will ask before paying.
de: Lege ein Limit fest, mit dem du dich wohlfühlst. Für alles darüber fragt Blip vor der Zahlung nach.
es: Establece un límite con el que te sientas cómodo. Para cualquier monto superior, Blip preguntará antes de pagar.

# onboarding_features_page2_subtitle
source: Pay small amounts instantly — no extra taps.
de: Kleine Beträge sofort bezahlen — ohne zusätzliche Taps.
es: Paga montos pequeños al instante — sin toques adicionales.

# onboarding_features_page2_title
source: Auto Pay, your rules
de: Auto Pay, deine Regeln
es: Auto Pay, tus reglas

# onboarding_features_page3_body
source: Connect the Blink wallet you already use. Blip focuses on fast in-person payments — everything else stays in your wallet.
de: Verbinde deine vorhandene Blink-Wallet. Blip konzentriert sich auf schnelle Zahlungen vor Ort — alles andere bleibt in deiner Wallet.
es: Conecta la billetera Blink que ya usas. Blip se enfoca en pagos rápidos en persona — todo lo demás permanece en tu billetera.

# onboarding_features_page3_subtitle
source: Blip is the checkout shortcut.
de: Blip ist nur die Checkout-Abkürzung.
es: Blip es solo el atajo para pagar.

# onboarding_features_page3_title
source: Your wallet stays your wallet
de: Deine Wallet bleibt deine Wallet
es: Tu billetera sigue siendo tu billetera

# onboarding_welcome_subtitle_line1
source: by Bitcoin Coast
de: von Bitcoin Coast
es: por Bitcoin Coast

# onboarding_welcome_subtitle_line2
source: The quickest way to pay with the Blink wallet you already use.
de: Der schnellste Weg, mit deiner vorhandenen Blink-Wallet zu bezahlen.
es: La forma más rápida de pagar con la billetera Blink que ya usas.

# onboarding_welcome_title
source: Welcome to Blip
de: Willkommen bei Blip
es: Bienvenido a Blip
